{
  "navbar": {
    "aboutMe": "About me",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "home": {
    "title": " Hello! Nice to see you here!",
    "descriptionProfile": "\"Truth can only be found in one place: the code.“",
    "aboutMe": "With a diverse trajectory, my professional journey began in the world of music, where I dedicated more than a decade to improving my talents as a multi-instrumentalist. I had the opportunity to play in different places and meet incredible people. In parallel with my career as a musician, I earned my degree in Business Administration and explored several professional opportunities, including a period as an entrepreneur.",
    "aboutMe2": "Today, I hold a postgraduate degree in Engineering and DevOps Planning, and I am fully immersed in the world of programming. I channel all my passion and creativity into creating real solutions for my clients, covering technologies that span from the Front-end to the Back-end, leveraging all the know-how I have accumulated throughout my life.",
    "aboutMe3": "I am an avid reader of topics such as Software Architecture, Clean Code, Design Patterns, Cybersecurity, TDD, and other techniques that enrich my journey as a programmer every day. My commitment is to continually learn and grow in this exciting field alongside my professional colleagues!"
  },
  "portfolio": {
    "title": "Portfolio!",
    "slide": {
      "techs": "Techs used",
      "services": "Services",
      "date": "Date",
      "info": "More info."
    },
    "projects": {
      "frontend": [
        {
          "title": "Space CalliX",
          "techs": "React, Styled-components, Typescript, yup",
          "services": "Code, UI/UX, External/internal API",
          "date": "October/2022",
          "description":
            "Project developed as part of a technical test for the Software Engineer position at Callix. The task involved using the SpaceX-API to make queries to four specific endpoints, aiming to obtain relevant data. The project was designed and implemented over the course of a week, demonstrating technical skills and the ability to meet specific deadlines. In addition to addressing all essential points requested, all extra tasks were carried out, including the implementation of Google Optimize and Hotjar."
        }, 
        {
          "title": "Oil Cycle",
          "techs": "React, Chakra.ui, Typescript, JSON Server",
          "services": "Code, UI/UX, Fake REST API",
          "date": "February/2022",
          "description":
            "The purpose of the site is to act as an intermediary between those who collect and those who donate cooking oil, aiming to reduce pollution resulting from improper disposal. The platform seeks to promote donation by encouraging a mutual benefit approach, where users have the opportunity to exchange their recycled oil for products offered by partners registered on the platform. This model creates a win-win environment, contributing to environmental sustainability and providing users with tangible benefits through their donations."      
        }, 
        {
          "title": "Habit management",
          "techs": "React, Styled-components, Javascript",
          "services": "Code, UI/UX, Integration with external APIs",
          "date": "December/2021",
          "description":
            "The platform's proposal is to allow users to register and manage their habits, in addition to participating in groups with individuals who share similar categories of habits and goals."
        },
        {
          "title": "Beverage management",
          "techs": "React, Styled-components, Javascript",
          "services": "Code, UI/UX, Integration with external APIs",
          "date": "November/2021",
          "description":
            "Project developed for educational purposes, aiming to use the Context API to create three distinct events in which the user can independently select the drinks list for each event through the API - PUNK API."
        }],
      "backend": [
          {
            "title": "Space CalliX - Back-end",
            "techs": "Node, Express, Redis, Typescript, yup",
            "services": "Code, API REST, External/internal API",
            "date": "October/2022",
            "description":
              "Project developed as part of a technical test for the Software Engineer position at Callix. The task involved using the SpaceX-API to make queries to four specific endpoints, aiming to obtain relevant data. The project was designed and implemented over the course of a week, demonstrating technical skills and the ability to meet specific deadlines. In addition to addressing all essential points requested, all extra tasks were carried out, including the implementation of Google Optimize and Hotjar."
          },
          {
            "title": "API Veterinary Clinic",
            "techs": "Python, Django, PostgreSQL",
            "services": "Code, API REST",
            "date": "July/2022",
            "description":
              "Developed with the purpose of serving veterinary clinics, the platform allows the registration of employees, clients, pets, consultations, anamnesis, diagnoses, histories, vaccine control, among other features."
          },
          {
            "title": "API Risk and Mental Health Classification",
            "techs": "Typescript, Node.js, Express, PostgreSQL, Jest",
            "services": "Code, API REST",
            "date": "June/2022",
            "description":
              "API developed to meet the needs of a clinical risk management teleservice system, with the objective of establishing priorities for the care of mental health patients who access the health system and also defining the most appropriate assistance resource for each case. Its main objective is to identify the most serious cases, allowing faster and safer care according to the potential risk, health problems or degree of suffering."
          },
          {
            "title": "ReOff API",
            "techs": "Python, Flask, PostgreSQL",
            "services": "Code, API REST",
            "date": "May/2022",
            "description":
              "The application aims to simplify and assist in the process of renting supplies and rooms. Through the exchange methodology, the application connects people who have products or rooms available for rent with those who are looking for these resources."
          }
        ]
    }
  },
  "contact": {
    "title": "Contact",
    "description": "Are you interested in my work? Feel free to get in touch! I would love to have the opportunity to communicate with you more effectively.",
    "form": {
      "placeholders": {
        "myName": "My name",
        "myEmail": "My e-mail",
        "myNumber": "My phone number",
        "select": {
          "default": "I would like to...",
          "firstOption": "I would like to ask a question",
          "secondOption": "I would like to make a proposal",
          "thirdOption": "I would like to start a project"
        },
        "description": "Write here"
      },
      "submit": "Send"
    }
  },
  "footer": {
    "text": "Copyright© 2022. Developed by me =)"
  }
}
