{
  "navbar": {
    "aboutMe": "About me",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "home": {
    "title": " Hello! Nice to see you here!",
    "descriptionProfile": "\"Truth can only be found in one place: the code.“",
    "aboutMe": "With a diverse trajectory, my professional journey began in the world of music, where I dedicated more than a decade to improving my talents as a multi-instrumentalist. I had the opportunity to play in different places and meet incredible people. In parallel with my career as a musician, I earned my degree in Business Administration and explored several professional opportunities, including a period as an entrepreneur.",
    "aboutMe2": "Today, I hold a postgraduate degree in Engineering and DevOps Planning, and I am fully immersed in the world of programming. I channel all my passion and creativity into creating real solutions for my clients, covering technologies that span from the Front-end to the Back-end, leveraging all the know-how I have accumulated throughout my life.",
    "aboutMe3": "I am an avid reader of topics such as Software Architecture, Clean Code, Design Patterns, Cybersecurity, TDD, and other techniques that enrich my journey as a programmer every day. My commitment is to continually learn and grow in this exciting field alongside my professional colleagues!"
  },
  "portfolio": {
    "title": "Portfolio!",
    "slide": {
      "techs": "Techs used",
      "services": "Services",
      "date": "Date",
      "info": "More info."
    }
  },
  "contact": {
    "title": "Contact",
    "description": "Are you interested in my work? Feel free to get in touch! I would love to have the opportunity to communicate with you more effectively.",
    "form": {
      "placeholders": {
        "myName": "My name",
        "myEmail": "My e-mail",
        "myNumber": "My phone number",
        "select": {
          "default": "I would like to...",
          "firstOption": "I would like to ask a question",
          "secondOption": "I would like to make a proposal",
          "thirdOption": "I would like to start a project"
        },
        "description": "Write here"
      },
      "submit": "Send"
    }
  }
}
